[
    {
        "title": "Ukraine war briefing: More Russian oil depots burn in drone attacks",
        "description": "New UK PM Starmer promises Zelenskiy ‘unwavering’ support; EU leadership condemns Orbán’s visit to Moscow. What we know on day 864",
        "content": "Drones on display at a Ukrainian military recruiting point in Kyiv. Photograph: Sergei Supinsky/AFP/Getty Images. \n\nOil depots in Russia’s Krasnodar region were burning after drone attacks over Friday night, reports said. Tanks at Pavlovskaya and Leningradskaya were hit, Russian regional officials confirmed. Nasa’s global satellite fire monitoring system showed blazes corresponding with the reports. Unconfirmed videos online showed fires that were purported to be at the sites. In the Yeisk area, a cellular communications tower was hit, the Russian operational headquarters said. \n\n- Volodymyr Zelenskiy, Ukraine’s president, has said after the election of a new UK government: “I am grateful to Keir Starmer for his assurances that Britain’s support for Ukraine will remain unchanged in principle.” Starmer’s office said he told Zelenskiy in a phone call that the Labour government would keep providing “unwavering” support for Kyiv in its war against Russia. Zelenskiy said he had wished the new PM success in fulfilling the expectations of the British people. Zelenskiy also thanked the outgoing Conservative PM, Rishi Sunak, for his steadfast support.\n\n- Zelenskiy said he and Starmer had “coordinated our positions” ahead of next week’s Nato summit at which Ukraine hopes to hear of possible steps to membership. A senior US official said Nato allies at their summit in Washington would unveil a “bridge to membership” for Ukraine and announce steps to bolster its air defences.\n\n- Zelenskiy said on Friday that he sought to double Ukraine’s air defence capacity over the summer “and now we are starting to see results”. Ukraine has received its third German-supplied Patriot system, adding to those given or pledged by other countries. It also operates US Hawk, German Iris and other systems to shoot down Russian drones, missiles and aircraft. Zelenskiy said Ukraine had also received on Friday “additional support” from the US but gave no details.\n\n- Ukraine and its Western allies have hit out at the pro-Kremlin Hungarian prime minister, Viktor Orbán, after Vladimir Putin hosted him in Moscow. The visit came a few days after Orbán made a similar unannounced trip to Kyiv, as he tries to position himself as a peace broker. Orbán this week assumed the rotating EU presidency until the end of the year and told reporters in Moscow that he viewed his six-month tenure as a peace mission.\n\n- The EU leadership in Brussels was quick to denounce the visit, stressing that Orbán had “not received any mandate from the EU council to visit Moscow” and did not speak for the EU, writes Pjotr Sauer. “Prime minister Viktor Orbán’s visit to Moscow takes place exclusively in the framework of the bilateral relations between Hungary and Russia. The Hungarian prime minister is thus not representing the EU in any form,” said Josep Borrell, the EU’s foreign policy chief.\n\n- Russian attacks on Friday killed eight people and injured at least 28 in Ukraine’s eastern frontline Donetsk region, the regional governor said. Five people were killed, and eight were injured when two Russian guided bombs struck the town of Selydove, west of the Russian-controlled city of Donetsk, said Vadym Filashkin. Separately, Russian troops dropped three guided bombs on the village of Komar, further south-west, killing a 32-year-old woman. Twenty others were injured, Filashkin said. Thirteen private houses, four shops and two residential buildings were damaged in the attack, he added, alongside two infrastructure facilities. \n\n(Source: The Guardian (2024). Ukraine war briefing: More Russian oil depots burn in drone attacks. https://www.theguardian.com/world/article/2024/jul/06/ukraine-war-briefing-starmer-assures-zelenskiy-of-unwavering-support)",
        "image": ["./images/politics.png"],
        "category": "politics",
        "time": "2024-07-01 18:00"
    },
    {
        "title": "Fifth annual Sarnia Vegfest showcases vegan lifestyle",
        "description": "Sarnia Vegfest 2023 (Photo courtesy of Sarnia Vegfest via Facebook)",
        "content": "All things vegan will be on full display at Sarnia's Canatara Park this weekend. \nThe fifth annual Vegfest is taking place Sunday, July 7 in the field by the bandshell stage. The free event features vegan food and drinks, live music, beach yoga, fashion, animal rights groups, as well as a sustainable market and children's activities. \nThere will also be a vegan cooking demo with samples with Paresh Thakkar at 12:15 p.m.\nHe'll be teaching people how to make a savoury vegetable and chickpea flour pancake with a market fruit chutney.\nOrganizer Tosha Lobsinger said there are a number of physical and mental benefits to choosing a whole foods plant-based diet.\n\"It reduces the chance of most major diseases and it's way more sustainable,\" said Lobsinger. \"If you think about the amount of resources needed to grow crops, to eat the plants directly, it's about ten to 20 times more crop needed to raise and feed an animal. Then, you're also obviously killing animals which are sentient beings just like us. It's about choosing healthier and more compassionate options.\"\nLobsinger said there's more to being vegan than just avoiding meat.\n\"Animal products can be, and are, in everything,\" she said. \"That's from food to materials that are used in clothing to ingredients used in shampoos, soaps and beauty products. Choosing vegan products is about finding great companies who make products that are cruelty free and don't exploit animals. They use plant ingredients that are healthier, more sustainable and better for everyone.\" /image\nLobsinger said they've received positive feedback over the years.\n\"It's been so good, we've had consistently between 1,000 to 4,000 people in attendance every year,\" said Lobsinger. \"Last year it rained and we still had a really good turnout. Everyone has a great time, and everyone enjoys trying the vegan foods and meeting all the small businesses who are making alternatives for a healthier planet and healthier humans.\"\nThe festival is sponsored by the Animal Alliance of Canada.\nVegfest runs from 10 a.m. until 6 p.m.\nFor more information visit www.sarniavegfest.com\n\n(Source: CKNews Today. (2024). Fifth annual Sarnia Vegfest showcases vegan lifestyle. https://cknewstoday.ca/sarnia/news/2024/07/06/fifth-annual-sarnia-vegfest-showcases-vegan-lifestyle)",
        "image": ["./images/life_1.png", "./images/life_2.png"],
        "category": "life",
        "time": "2024-07-14 12:00"
    },
    {
        "title": "Dollar inches up against dong on black market",
        "description": "Woman holds U.S. dollar banknotes in this illustration taken May 30, 2022. Photo by Reuters",
        "content": "The U.S. dollar rose against the Vietnamese dong on the black market Saturday but remained steady at banks.\nUnofficial exchange points sold the greenback at VND25,890, up 0.25% from Friday.\nVietcombank kept the dollar stable at VND25,458. /image \nThe State Bank of Vietnam (SBV)’s reference rate was unchanged at VND24,246.\nSince the start of the year, the dollar has increased against the dong by 4.25%.\nGlobally, the U.S. dollar index stayed slightly lower on Friday after data showed U.S. job growth slowed marginally in June while the unemployment rate rose, underscoring the view the Federal Reserve could begin cutting interest rates in September, Reuters reported.\nThe dollar index, which measures the greenback against a basket of currencies, was last down 0.28% at 104.87 and hit a three-week low early.\nAgainst the Japanese yen, the dollar weakened 0.34% to 160.73. It was near 160.45 just after the U.S. payrolls data.\nThe euro was last up 0.23% at $1.0835 and on track for its biggest weekly gain of the year against the dollar.\n\"We see rates coming down across the curve on confirmation of a moderation in U.S. labor markets. The unexpected rise in the unemployment rate, the deceleration in wage gains and revisions in prior months' headline gains all point to a slowing in labor market conditions,\" said Karl Schamotta, chief market strategist at Corpay in Toronto.\n\"This is... raising the likelihood that we do see (Fed) Chair Powell put a September rate cut on the table either at the July policy meeting or at the Jackson Hole conference in August.\"\n\n(Source: Vn Express (2024). Dollar inches up against dong on black market. Link: https://e.vnexpress.net/news/business/markets/dollar-inches-up-against-dong-on-black-market-4766861.html)",
        "image": ["./images/business_1.png", "./images/business_2.png"],
        "category": "business",
        "time": "2024-07-14 12:00"
    },
    {
        "title": "Spain strike late to beat England 2-1 and win Euro 2024",
        "description": "Spain's Marc Cucurella controls the ball in the Euro 2024 final with England on July 14, 2024. Photo by Reuters",
        "content": "Spain substitute Mikel Oyarzabal slid in for an 86th-minute winner to earn his team a 2-1 Euro 2024 final victory over England on Sunday and a record fourth European crown. \nOyarzabal finished off a break for the winning goal as Spain were crowned champions, having won all seven games they played in the tournament \nAfter an extremely cautious first half whereSpainhad more possession and their opponents got the only shot on target, it only took two minutes after the restart for the Spaniards to break the deadlock. \nTeenager Lamine Yamal found space down the right and delivered an assist for fellow winger Nico Williams to slot before England, who fell behind for the fourth successive game in the tournament, levelled in the 73rd through substitute Cole Palmer. \nOyarzabal, however, denied them their first major international trophy for 58 years. \n\n(Source: VnExpress (2024). Spain strike late to beat England 2-1 and win Euro 2024 https://e.vnexpress.net/news/sports/football/spain-strike-late-to-beat-england-2-1-and-win-euro-2024-4769950.html)",
        "image": ["./images/entertainment_1.png"],
        "category": "entertainment",
        "time": "2024-07-15 12:00"
    },
    {
        "title": "Ed Sheeran announces the end of his Mathematics Tour in 2025",
        "description": "He also revealed European dates for the last leg of his three-year tour.",
        "content": "Ed Sheeran has revealed that his long-running Mathematics Tour will conclude in 2025. \n\nIn an Instagram video posted on July 5, Sheeran informed his fans of the news, saying, \"2025 is the end of the Mathematics Tour. We're going to be doing big shows in Europe and some more that we're going to announce soon.\n\"The video was accompanied by a caption that read: \"In 2025, Mathematics Tour comes to an end! Gonna be hitting most of the other places we haven't been to yet, but the first dates to go up will be the rest of Europe, more to follow, but European dates on sale July 10th (Rome July 12th), see you next year. It was time to Stop, but then we can press Play…\" \n\nThe European leg of Sheeran's tour will begin in Madrid on May 5, 2025, according to his official website.\n\nFrom there, Sheeran will take the stage in several major cities, including Rome, Oslo, Zurich, Stockholm, and Copenhagen. /image \nThe final European concert is scheduled for Sept. 9, 2025, in Düsseldorf, Germany.\n\nSheeran is currently on tour with upcoming stops in Poland and Hungary this month.\n\nThe tour kicked off in April 2022.\n\n(Source: ABC News. (2024). Ed Sheeran announces the end of his Mathematics Tour in 2025. https://abcnews.go.com/GMA/Culture/ed-sheeran-announces-end-mathematics-tour-2025/story?id=111714433)",
        "image": ["./images/entertainment_2.png", "./images/entertainment_3.png"],
        "category": "entertainment",
        "time": "2024-07-14 12:00"
    }
]
